import React from 'react';

import headerImage from '../../assets/header-image.jpg';
import workerImage from '../../assets/worker-image.jpg'; 
import styles from './AboutZone.module.css';

function AboutZone() {
  return (
    <section className={styles.aboutZone}>
      <div className={styles.header}>
        <img src={headerImage} alt="Abandoned room in the exclusion zone" className={styles.headerImage} />
        <h1 className={styles.title}>Все про зону</h1>
      </div>
      <div className={styles.content}>
        <p>
        Населення з забруднених територій було евакуйовано. Для робітників, що лишилися обслуговувати електростанцію і Зону відчуження, був організований строгий дозиметричний контроль транспорту, розгорнуто пункти дезактивації. На межах зон була організована пересадка працівників з одних транспортних засобів в інші для зменшення перенесення радіоактивних речовин та радіаційної пилу.

Однак великі площі забруднених територій залишалися за межами 30-кілометрової зони, і починаючи з 1990-х років проводилося поступове відселення населених пунктів Поліського району, в яких рівень забруднення радіонуклідами перевищував встановлені норми. Так, до 1996 року були остаточно відселені смт. Поліське, смт. Вільча, с. Діброва, с. Новий Світ і багато інших. З 1997 року ця територія увійшла до складу чорнобильської зони,і була передана під управління ГСЧС і включена в охоронний периметр.

Чорнобильська катастрофа прокотилася вогняним смерчем не тільки по людських долях, розділивши їх життя на момент до аварії і на момент після, але зробила істотний вплив на всю господарську діяльність не тільки регіону, але і всієї країни в цілому. Не кажучи про багатомільйонні витрати на гасіння пожежі на четвертому блоці електростанції, на ліквідацію наслідків цієї трагедії, не слід забувати і про те, що ЧАЕС була важливою складовою всієї енергетичної потужності Радянського Союзу. Неймовірно родючі ґрунти Півночі України та частини Білорусі були засмічені радіоактивними елементами і стали непридатні для використання в сільському господарстві (близько 5 млн. га). Аграрна, військова (одна з найсучасніших радіолокаційних станцій Дуга - 1 була визнана небезпечною для життя і кинута в зоні відчуження), пожежна, інші види спеціальної техніки, так само як і особистий автотранспорт були поховані через радіоактивне випромінювання, що виходить від них. Бетон і цегла, які добре вбирають у себе радіоактивне випромінювання, унеможливили проживання сотні тисяч жителів у своїх будинках. Були кинуті маленькі селища, села, невеликі міста, найбільшим з яких є Припять.
        </p>
        <img src={workerImage} alt="Worker in protective suit near reactor" className={styles.workerImage} />
        <p>
        Одним з факторів радіоактивного забруднення стали випари радіоактивних елементів, які перетворилися на смертоносні аерозолі. Небезпека їх полягала в тому, що вони легко розносилися вітром на сотні кілометрів, осідали з дощами та іншими видами опадів, і виявлялися далеко від місця трагедії. Так, через напрямок вітру радіоактивну хмару було зафіксовано не тільки в Білорусі, але і в країнах Скандинавії.

В результаті природних процесів, а також цілеспрямованої діяльності спеціальних команд, на даний момент рівень забруднення в зоні значно знизився. Найбільший фон, крім місць скупчення техніки, бетонних будівель, дають ліси. Причина цього в тому, що цезій рециркулює в екосистемі безперервно, але при цьому лише малий відсоток його виводиться самостійно. Тому дари лісу - ягоди, валежник, гриби - таять у собі небезпеку. Так само як і мешканці лісів і річок.
        </p>
      </div>
    </section>
  );
}

export default AboutZone;
